Solution 1 ("Simple Dense") -> Accuracy (train, val, test): 0.2075, 0.2140, 0.2188
    __________________________________________  
    Layer (type)      Output Shape     Param #
    ==========================================
    flatten (Flatten) (None, 270000)   0      
    __________________________________________
    dense (Dense)     (None, 128)      3456012
    __________________________________________
    dropout (Dropout) (None, 128)      0      
    __________________________________________
    dense_1 (Dense)   (None, 9)        1161   
    ==========================================

    params: 3,457,173

Solution 2 ("Simple Convolutional") -> Accuracy (train, val, test): 1.0, 0.4580, 0.4920
    __________________________________________
    Layer (type)      Output Shape     Param #
    ==========================================
    conv2d (Conv2D)   (None, 294, 294, 4736   
    __________________________________________
    max_pooling2d (Ma (None, 147, 147, 0      
    __________________________________________
    flatten (Flatten) (None, 691488)   0      
    __________________________________________
    dense (Dense)     (None, 128)      8851059
    __________________________________________
    dropout (Dropout) (None, 128)      0      
    __________________________________________
    dense_1 (Dense)   (None, 9)        1161   
    ==========================================

    params: 8,856,956

Solution 3 ("Complex Convolutional") -> Accuracy (train, val, test): 0.3895, 0.1198, 0.1262
    _________________________________________________________________
    Layer (type)                 Output Shape              Param #   
    =================================================================
    conv2d (Conv2D)              (None, 296, 296, 32)      2432      
    _________________________________________________________________
    batch_normalization (BatchNo (None, 296, 296, 32)      128       
    _________________________________________________________________
    conv2d_1 (Conv2D)            (None, 292, 292, 32)      25632     
    _________________________________________________________________
    max_pooling2d (MaxPooling2D) (None, 146, 146, 32)      0         
    _________________________________________________________________
    batch_normalization_1 (Batch (None, 146, 146, 32)      128       
    _________________________________________________________________
    dropout (Dropout)            (None, 146, 146, 32)      0         
    _________________________________________________________________
    conv2d_2 (Conv2D)            (None, 142, 142, 64)      51264     
    _________________________________________________________________
    batch_normalization_2 (Batch (None, 142, 142, 64)      256       
    _________________________________________________________________
    conv2d_3 (Conv2D)            (None, 138, 138, 64)      102464    
    _________________________________________________________________
    max_pooling2d_1 (MaxPooling2 (None, 69, 69, 64)        0         
    _________________________________________________________________
    batch_normalization_3 (Batch (None, 69, 69, 64)        256       
    _________________________________________________________________
    dropout_1 (Dropout)          (None, 69, 69, 64)        0         
    _________________________________________________________________
    conv2d_4 (Conv2D)            (None, 65, 65, 128)       204928    
    _________________________________________________________________
    batch_normalization_4 (Batch (None, 65, 65, 128)       512       
    _________________________________________________________________
    conv2d_5 (Conv2D)            (None, 61, 61, 128)       409728    
    _________________________________________________________________
    max_pooling2d_2 (MaxPooling2 (None, 30, 30, 128)       0         
    _________________________________________________________________
    batch_normalization_5 (Batch (None, 30, 30, 128)       512       
    _________________________________________________________________
    dropout_2 (Dropout)          (None, 30, 30, 128)       0         
    _________________________________________________________________
    flatten (Flatten)            (None, 115200)            0         
    _________________________________________________________________
    dense (Dense)                (None, 64)                7372864   
    _________________________________________________________________
    batch_normalization_6 (Batch (None, 64)                256       
    _________________________________________________________________
    dropout_3 (Dropout)          (None, 64)                0         
    _________________________________________________________________
    dense_1 (Dense)              (None, 32)                2080      
    _________________________________________________________________
    batch_normalization_7 (Batch (None, 32)                128       
    _________________________________________________________________
    dropout_4 (Dropout)          (None, 32)                0         
    _________________________________________________________________
    dense_2 (Dense)              (None, 9)                 297       
    =================================================================
    Total params: 8,173,865
    Trainable params: 8,172,777
    Non-trainable params: 1,088
    _________________________________________________________________